benchmarks/results/20260705221732-api-query/raw.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/k6/api-query.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * constant_request_rate: 50.00 iterations/s for 30s (maxVUs: 5-50, gracefulStop: 30s)


running (0m01.0s), 22/26 VUs, 7 complete and 0 interrupted iterations
constant_request_rate   [   3% ] 22/26 VUs  01.0s/30s  50.00 iters/s

running (0m02.0s), 00/35 VUs, 70 complete and 0 interrupted iterations
constant_request_rate   [   7% ] 00/35 VUs  02.0s/30s  50.00 iters/s

running (0m03.0s), 00/35 VUs, 120 complete and 0 interrupted iterations
constant_request_rate   [  10% ] 00/35 VUs  03.0s/30s  50.00 iters/s

running (0m04.0s), 00/35 VUs, 170 complete and 0 interrupted iterations
constant_request_rate   [  13% ] 00/35 VUs  04.0s/30s  50.00 iters/s

running (0m05.0s), 00/35 VUs, 220 complete and 0 interrupted iterations
constant_request_rate   [  17% ] 00/35 VUs  05.0s/30s  50.00 iters/s

running (0m06.0s), 00/35 VUs, 270 complete and 0 interrupted iterations
constant_request_rate   [  20% ] 00/35 VUs  06.0s/30s  50.00 iters/s

running (0m07.0s), 00/35 VUs, 320 complete and 0 interrupted iterations
constant_request_rate   [  23% ] 00/35 VUs  07.0s/30s  50.00 iters/s

running (0m08.0s), 00/35 VUs, 370 complete and 0 interrupted iterations
constant_request_rate   [  27% ] 00/35 VUs  08.0s/30s  50.00 iters/s

running (0m09.0s), 00/35 VUs, 420 complete and 0 interrupted iterations
constant_request_rate   [  30% ] 00/35 VUs  09.0s/30s  50.00 iters/s

running (0m10.0s), 00/35 VUs, 470 complete and 0 interrupted iterations
constant_request_rate   [  33% ] 00/35 VUs  10.0s/30s  50.00 iters/s

running (0m11.0s), 00/35 VUs, 520 complete and 0 interrupted iterations
constant_request_rate   [  37% ] 00/35 VUs  11.0s/30s  50.00 iters/s

running (0m12.0s), 00/35 VUs, 570 complete and 0 interrupted iterations
constant_request_rate   [  40% ] 00/35 VUs  12.0s/30s  50.00 iters/s

running (0m13.0s), 00/35 VUs, 620 complete and 0 interrupted iterations
constant_request_rate   [  43% ] 00/35 VUs  13.0s/30s  50.00 iters/s

running (0m14.0s), 00/35 VUs, 670 complete and 0 interrupted iterations
constant_request_rate   [  47% ] 00/35 VUs  14.0s/30s  50.00 iters/s

running (0m15.0s), 00/35 VUs, 720 complete and 0 interrupted iterations
constant_request_rate   [  50% ] 00/35 VUs  15.0s/30s  50.00 iters/s

running (0m16.0s), 00/35 VUs, 770 complete and 0 interrupted iterations
constant_request_rate   [  53% ] 00/35 VUs  16.0s/30s  50.00 iters/s

running (0m17.0s), 00/35 VUs, 820 complete and 0 interrupted iterations
constant_request_rate   [  57% ] 00/35 VUs  17.0s/30s  50.00 iters/s

running (0m18.0s), 00/35 VUs, 870 complete and 0 interrupted iterations
constant_request_rate   [  60% ] 00/35 VUs  18.0s/30s  50.00 iters/s

running (0m19.0s), 00/35 VUs, 920 complete and 0 interrupted iterations
constant_request_rate   [  63% ] 00/35 VUs  19.0s/30s  50.00 iters/s

running (0m20.0s), 00/35 VUs, 970 complete and 0 interrupted iterations
constant_request_rate   [  67% ] 00/35 VUs  20.0s/30s  50.00 iters/s

running (0m21.0s), 00/35 VUs, 1020 complete and 0 interrupted iterations
constant_request_rate   [  70% ] 00/35 VUs  21.0s/30s  50.00 iters/s

running (0m22.0s), 00/35 VUs, 1070 complete and 0 interrupted iterations
constant_request_rate   [  73% ] 00/35 VUs  22.0s/30s  50.00 iters/s

running (0m23.0s), 00/35 VUs, 1120 complete and 0 interrupted iterations
constant_request_rate   [  77% ] 00/35 VUs  23.0s/30s  50.00 iters/s

running (0m24.0s), 00/35 VUs, 1170 complete and 0 interrupted iterations
constant_request_rate   [  80% ] 00/35 VUs  24.0s/30s  50.00 iters/s

running (0m25.0s), 00/35 VUs, 1220 complete and 0 interrupted iterations
constant_request_rate   [  83% ] 00/35 VUs  25.0s/30s  50.00 iters/s

running (0m26.0s), 00/35 VUs, 1270 complete and 0 interrupted iterations
constant_request_rate   [  87% ] 00/35 VUs  26.0s/30s  50.00 iters/s

running (0m27.0s), 00/35 VUs, 1320 complete and 0 interrupted iterations
constant_request_rate   [  90% ] 00/35 VUs  27.0s/30s  50.00 iters/s

running (0m28.0s), 00/35 VUs, 1370 complete and 0 interrupted iterations
constant_request_rate   [  93% ] 00/35 VUs  28.0s/30s  50.00 iters/s

running (0m29.0s), 00/35 VUs, 1420 complete and 0 interrupted iterations
constant_request_rate   [  97% ] 00/35 VUs  29.0s/30s  50.00 iters/s

running (0m30.0s), 00/35 VUs, 1470 complete and 0 interrupted iterations
constant_request_rate   [ 100% ] 00/35 VUs  30.0s/30s  50.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 7       0.233325/s
    checks_succeeded...: 100.00% 7 out of 7
    checks_failed......: 0.00%   0 out of 7

    ✓ status was 200

    HTTP
    http_req_duration..............: avg=17.94ms min=0s       med=0s       max=1.22s    p(90)=0s       p(95)=0s      
      { expected_response:true }...: avg=343.5ms min=139.22ms med=324.87ms max=574.78ms p(90)=574.49ms p(95)=574.71ms
    http_req_failed................: 99.05% 1463 out of 1477
    http_reqs......................: 1477   49.231514/s

    EXECUTION
    dropped_iterations.............: 30     0.999963/s
    iteration_duration.............: avg=18.44ms min=194µs    med=353.12µs max=1.23s    p(90)=456.28µs p(95)=522.74µs
    iterations.....................: 1470   48.99819/s
    vus............................: 0      min=0            max=22
    vus_max........................: 35     min=26           max=35

    NETWORK
    data_received..................: 3.5 kB 117 B/s
    data_sent......................: 9.3 kB 310 B/s



running (0m30.0s), 00/35 VUs, 1470 complete and 0 interrupted iterations
constant_request_rate ✓ [ 100% ] 00/35 VUs  30s  50.00 iters/s